# parameters
nc: 4  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [40,44, 34,33, 50,46]
  # - [10,13, 16,30, 33,23]  # P3/8
  # - [30,61, 62,45, 59,119]  # P4/16
  # - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone  
# arg是输出通道和kernel_size等参数

backbone:
  [[-1, 1, Focus, [64, 3]], # 1/2
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 3, C3, [128]],   
   [-1, 1, nn.MaxPool2d, [2]], # 1/4
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 9, C3, [256]], 
   [-1, 1, nn.MaxPool2d, [2]], # 1/8
   [-1, 1, Conv, [512, 3, 1]],
   [-1, 3, C3, [512]], 
   [-1, 1, nn.MaxPool2d, [2]], # 1/16
   [-1, 1, Conv, [512, 3, 1]], # 
   [-1, 3, C3, [512]],  # 
   [-1, 1, Conv, [1024, 3, 1]], # center---------------------------------------------------------------------------
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 1/8 decoder-------------------------------------------------------------------------
   [-1, 1, Conv, [512, 3, 1]],
   [-1, 3, C3, [512]],
   [[-1, 8], 1, Concat, [1]],
   [-1, 1, Conv, [512, 3, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 1/4 decoder-------------------------------------------------------------------------
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 3, C3, [256]],
   [[-1, 5], 1, Concat, [1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 1/2 decoder-------------------------------------------------------------------------
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 3, C3, [128]],
   [[-1, 2], 1, Concat, [1]],
   [-1, 1, Conv, [128, 3, 1]]
  ]

# YOLOv5 head
head:
  [
   [[16], 1, Detect, [nc, anchors]],  # 31 Detect(P3, P4, P5)
  ]






  







